<template>
	<view>
		<oct-logistics
			:info="info"
			:logs="logs"
		/>
	</view>
</template>

<script>
export default {
	data() {
		return {
			info: {
				logo: 'https://t12.baidu.com/it/u=3775999286,734565944&fm=58',
				no: 'SF1321247449577',
				company: '顺丰速运'
			},
			logs: [
				{
					state: '已签收',
					date: '2021-10-20 09:09',
					info:'您的快件已签收，如有疑问请电联快递员【刘洪召，电话：18522939113】。疫情期间顺丰每日对网点消毒、快递员每日测温、配戴口罩，感谢您使用顺丰，期待再次为您服务。（主单总件数：1件）'
				},
				{
					state: '派送中',
					date: '2021-10-20 07:58',
					info: '快件交给刘洪召,正在派送途中（联系电话：18522939113,顺丰已开启“安全呼叫”保护您的电话隐私,请放心接听！）（主单总件数：1件）'
				},
				{
					state: '运送中',
					date: '2021-10-19 16:36',
					info: '快件到达 【天津市武清区宏兴营业点】'
				},
				{
					state: '运送中',
					date: '2021-10-19 15:18',
					info: '快件已发车'
				},
				{
					state: '运送中',
					date: '2021-10-19 15:18',
					info: '快件在【天津机场中转场】完成分拣,准备发往 【天津市武清区宏兴营业点】'
				},
				{
					state: '运送中',
					date: '2021-10-18 18:10',
					info: '快件在【哈尔滨龙运中转场】完成分拣,准备发往下一站'
				},
				{
					state: '已取件',
					date: '2021-10-18 13:11',
					info: '顺丰速运 已收取快件'
				}
			]
		};
	},
	methods: {
		onAdd(){
			this.logs = []
		}
	}
};
</script>

<style></style>
